cumt_sim/text.md
```mermaid
graph TD
A[driver_link]-->B1(joint_pedestal)
A[driver_link]-->B2(joint_radar)
A[driver_link]-->B3(joint_pedestal)
B1(joint_pedestal)-->C1[pedestal_link]
B2(joint_radar)-->C2[radar_link]
B3(joint_support)-->C3[support_frame_link]
C3[support_frame_link]-->D(joint_wind)
D(joint_wind)-->E[wind_vane_link]
```
